IRP/src/Documents/ProductionPlanning/ProductionPlanning.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionPlanning</name>
  <registerRecords>AccumulationRegister.MF_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.MF_ProductionPlanning</registerRecords>
  <registerRecords>InformationRegister.MF_BillOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.MF_DetailingSupplies</registerRecords>
  <registerRecords>InformationRegister.T7010S_BillOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.R7010T_DetailingSupplies</registerRecords>
  <registerRecords>AccumulationRegister.R7020T_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R7030T_ProductionPlanning</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Productions</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>BillOfMaterials</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ReleaseStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>MaterialStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>SemiproductStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>IsProduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsSemiproduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsMaterial</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsService</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UniqueID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PlanningPeriod</name>
      <type>
        <types>CatalogRef.PlanningPeriods</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisUnit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/ProductionPlanning/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;	
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	Query = New Query();
	Query.Text = 
	"SELECT TOP 1
	|	MF_ProductionPlanning.Ref
	|FROM
	|	Document.MF_ProductionPlanning AS MF_ProductionPlanning
	|WHERE
	|	MF_ProductionPlanning.Company = &Company
	|	AND MF_ProductionPlanning.BusinessUnit = &BusinessUnit
	|	AND MF_ProductionPlanning.PlanningPeriod = &PlanningPeriod
	|	AND MF_ProductionPlanning.Ref <> &Ref
	|	AND NOT MF_ProductionPlanning.DeletionMark
	|	AND MF_ProductionPlanning.Posted";
	Query.SetParameter("Company"       , ThisObject.Company);
	Query.SetParameter("BusinessUnit"  , ThisObject.BusinessUnit);
	Query.SetParameter("PlanningPeriod", ThisObject.PlanningPeriod);
	Query.SetParameter("Ref", ThisObject.Ref);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	If QuerySelection.Next() Then
		Cancel = True;
		MessageText = StrTemplate(R().MF_Error_003, 
		ThisObject.Company, 
		ThisObject.BusinessUnit,  
		ThisObject.PlanningPeriod);
		CommonFunctionsClientServer.ShowUsersMessage(MessageText, "Object.PlanningPeriod", "Object");
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	Return;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;	
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure
